---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailSupportsLayout.FixedNumber
enum: Autodesk.Revit.DB.Architecture.RailSupportsLayout
source: html/58c35d10-0327-cea3-18a3-6ee3db6ddb4c.htm
---
# Autodesk.Revit.DB.Architecture.RailSupportsLayout.FixedNumber

The rail supports are laid out with a specified fixed number.